hms-homelab/hms-fysetc/sdkconfig.defaults
# Target: ESP32 (PICO-D4 on FYSETC SD WiFi Pro)
CONFIG_IDF_TARGET="esp32"

# Flash (4MB internal on ESP32-PICO-D4)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM disabled (not all FYSETC boards have PSRAM populated)
# CONFIG_ESP32_SPIRAM_SUPPORT is not set

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# SDMMC (4-bit SDIO mode for onboard NAND)
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# HTTP client
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096
